// Copyright (c) 2011 The Chromium OS Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

"Menu About" = "เกี่ยวกับตัวสร้างอิมเมจระบบปฏิบัติการ Chrome";
"Menu Prefs" = "ค่ากำหนด..";
"Menu Services" = "บริการ";
"Menu Hide" = "ซ่อนตัวสร้างอิมเมจระบบปฏิบัติการ Chrome";
"Menu Hide Others" = "ซ่่อนสิ่งอื่น";
"Menu Show All" = "แสดงทั้งหมด";
"Menu Quit" = "ออกจากตัวสร้างอิมเมจระบบปฏิบัติการ Chrome";
"Menu Window" = "หน้าต่าง";
"Menu Minimize" = "ลดขนาด";
"Menu Zoom" = "ย่อ/ขยาย";
"Menu Bring All To Front" = "นำทั้งหมดมาไว้ด้านหน้า";
"Menu Help" = "วิธีใช้";
"Menu App Help" = "วิธีใช้ตัวสร้างอิมเมจระบบปฏิบัติการ Chrome";

/* Buttons */
"Button Previous" = "ก่อนหน้า";
"Button Next" = "ถัดไป";
"Button Stop" = "หยุด";
"Button Done" = "เสร็จสิ้น";

/* Tab: Select device model */
"Text Welcome" = "ยินดีต้อนรับสู่ตัวสร้างอิมเมจระบบปฏิบัติการ Chrome! โปรดเลือกรุ่นอุปกรณ์ของระบบปฏิบัติการ Chrome ที่คุณใช้งานอยู่";
"Button Local Image" = "อิมเมจในเครื่อง…";

/* Tab: Select USB stick */
"Text Select Prompt" = "เลือกอุปกรณ์หน่วยความจำ USB ให้แก่ผู้ใช้เพื่อใช้กู้คืน:";
"Text Insertion Prompt" = "โปรดใส่อุปกรณ์หน่วยความจำ USB";

/* Tab: Done */
"Text Congrats" = "ขอแสดงความยินดีกับการสร้างไดรฟ์สำหรับบูตเพื่อการกู้คืนระบบสำหรับเครื่องที่ใช้ระบบปฏิบัติการ Chrome ของคุณ โปรดนำไดรฟ์ออกจากคอมพิวเตอร์และใช้ในการกู้คืนระบบปฏิบัติการที่เสียหายบน Chromebook ที่คุณใช้งาน ";

/* Error starting Disk Arbitration. */
"NoDiskArb Message" = "แอปพลิเคชันนี้ไม่สามารถเรียกใช้ได้";
"NoDiskArb Informative" = "พบปัญหาในการเริ่มใช้กฎการจัดสรรพื้นที่ดิสก์ซึ่งไม่ควรเกิดขึ้น";
"NoDiskArb OK" = "ตกลง";

/* Error retrieving config file. */
"CantGetConfig Message" = "ไม่สามารถเรียกดูรายการอิมเมจ";
"CantGetConfig Informative" = "พบปัญหาในการเรียกดูรายการอิมเมจการกู้คืนที่ใช้ได้ (%1$@) โปรดตรวจสอบให้แน่ใจว่าการเชื่อมต่อเครือข่ายของคุณใช้การได้";
"CantGetConfig OK" = "ตกลง";
"CantGetConfig Error NoConnection" = "ไม่สามารถจัดสรรการเชื่อมต่อ";
"CantGetConfig Error DownloadError" = "พบข้อผิดพลาดระหว่างดาวน์โหลด";
"CantGetConfig Error StringCreate" = "ไม่สามารถใช้การตอบกลับ";

/* Version error. */
"VersionError Message" = "แอปพลิเคชันรุ่นนี้เก่าเกินไป";
"VersionError Informative" = "โปรดดาวน์โหลดรุ่นใหม่กว่านี้ นี่คือรุ่น %1$@; อย่างน้อยที่สุดต้องใช้รุ่น %2$@ %3$@";
"VersionError OK" = "รับรุ่นใหม่";

/* File dialog to select a local file. */
"SelectLocal File" = "โปรดเลือกอิมเมจ:";
"SelectLocal Button" = "เลือก";

/* Alert on writing stick. */
"WriteAlert Message" = "คุณแน่ใจหรือไม่ว่าต้องการลบ %1$@ อย่างถาวร?";
"WriteAlert Informative" = "ข้อมูลทั้งหมดที่มีอยู่ในขณะนี้จะถูกลบอย่างถาวร คุณไม่สามารถเลิกทำการทำงานนี้ได้";
"WriteAlert Cancel" = "อย่าลบ";
"WriteAlert OK" = "ลบ";

"TooSmallAlert Message" = "ไม่สามารถใช้ %1$@ ได้เนื่องจากเล็กเกินไป";
"TooSmallAlert Informative" = "ต้องใช้อุปกรณ์หน่วยความจำ %2$@ เป็นอย่างน้อย";
"TooSmallAlert OK" = "ตกลง";

"NotWritable Message" = "ไม่สามารถใช้ %1$@ ได้เนื่องจากเป็นแบบอ่านอย่างเดียว";
"NotWritable Informative" = "หน่วยความจำนี้เป็นแบบอ่านอย่างเดียวซึ่งอาจมีสวิตช์สำหรับเปิดให้เขียนได้ หรือไม่อุปกรณ์นี้อาจใช้ไม่ได้";
"NotWritable OK" = "ตกลง";

/* Stick writing statuses. */
"Status Downloading" = "กำลังดาวน์โหลด…";
"Status Verifying" = "กำลังตรวจสอบ…";
"Status Unpacking" = "กำลังคลายแพ็ค…";
"Status Claiming" = "กำลังเข้าถึง…";
"Status Unmounting" = "กำลังยกเลิกการต่อเชื่อม…";
"Status Writing" = "กำลังเขียน…";
"Status Ejecting" = "กำลังนำออก…";
"Status Done" = "เสร็จสิ้น!";

"StatusAdd Attempt" = " (พยายาม %1$d)";

/* Errors */
"Failure Downloading" = "ขออภัย พบข้อผิดพลาด (ไม่สามารถดาวน์โหลดอิมเมจต้นฉบับ) คุณต้องการลองอีกครั้งหรือไม่";
"Failure Verifying Return Value" = "ขออภัย พบข้อผิดพลาด (ไม่สามารถตรวจสอบอิมเมจต้นฉบับ โปรแกรมล้มเหลว %1$s) คุณต้องการลองอีกครั้งหรือไม่";
"Failure Verifying SHA Mismatch" = "ขออภัย พบข้อผิดพลาด (ไม่สามารถตรวจสอบอิมเมจต้นฉบับ เนื่องจาก checksum ล้มเหลว) คุณต้องการลองอีกครั้งหรือไม่";
"Failure Unpacking" = "ขออภัย พบข้อผิดพลาด (ไม่สามารถคลายแพ็คอิมเมจต้นฉบับ %1$s) คุณต้องการลองอีกครั้งหรือไม่";
"Failure Claiming" = "ขออภัย พบข้อผิดพลาด (ไม่สามารถเข้าถึงอุปกรณ์หน่วยความจำ USB) คุณต้องการลองอีกครั้งหรือไม่";
"Failure Unmounting" = "ขออภัย พบข้อผิดพลาด (ไม่สามารถยกเลิกการต่อเชื่อมอุปกรณ์หน่วยความจำ USB) คุณต้องการลองอีกครั้งหรือไม่";
"Failure Opening Source Image" = "ขออภัย อุปกรณ์ (ไม่สามารถเปิดอิมเมจต้นฉบับ %1$s) คุณต้องการลองอีกครั้งหรือไม่";
"Failure Opening Destination Device" = "ขออภัย พบข้อผิดพลาด (ไม่สามารถเปิดอุปกรณ์หน่วยความจำ USB %1$s) คุณต้องการลองอีกครั้งหรือไม่";
"Failure Reading Source Image" = "ขออภัย พบข้อผิดพลาด (ไม่สามารถอ่านจากอิมเมจต้นฉบับ %1$s) คุณต้องการลองอีกครั้งหรือไม่";
"Failure Writing Destination Device" = "ขออภัย พบข้อผิดพลาด (ไม่สามารถเขียนข้อมูลลงในอุปกรณ์หน่วยความจำ USB %1$s) คุณต้องการลองอีกครั้งหรือไม่";
"Failure Ejecting" = "ขออภัย พบข้อผิดพลาด (ไม่สามารถนำอุปกรณ์หน่วยความจำ USB ออก) คุณต้องการลองอีกครั้งหรือไม่";

"Failure Try Again" = "ลองอีกครั้ง";
"Failure Quit" = "ออก";

"Failure Termination Status" = "สถานะการสิ้นสุด %d";

"Failure Internal Error 1" = "EOF ที่ไม่คาดหมาย";
